Revit 2026 API

# ApplicationExtractPartAtomFromFamilyFile Method

---

Writes a PartAtom XML from the contents of a family file.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ExtractPartAtomFromFamilyFile(
	string familyFilePath,
	string xmlFilePath
)
```
```vb
Public Sub ExtractPartAtomFromFamilyFile (
	familyFilePath As String,
	xmlFilePath As String
)
```
```cpp
public:
void ExtractPartAtomFromFamilyFile(
	String^ familyFilePath,
	String^ xmlFilePath
)
```
```fsharp
member ExtractPartAtomFromFamilyFile :
        familyFilePath : string *
        xmlFilePath : string -> unit
```

#### Parameters

familyFilePath String
    The family file to be processed.
xmlFilePath String
    The xml file to be saved.

| Exception | Condition |
| --- | --- |
| ArgumentException | If 'familyFilePath' or 'xmlFilePath' is  or an empty string or if the family file doesn't exist on disk. |

If there is a TXT type catalog next to the family file (a TXT file with the same name as the RFA file), the function will read it as well and process its contents into PartAtom. To extract a PartAtom XML from a family loaded into a document in session, use Family.ExtractPartAtom().

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace